## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 77 to add, 0 to change, 70 to destroy.</code></pre>

* Create
  * azurerm_linux_function_app.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
* Replace
  * azurerm_application_insights.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_application_insights.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_action_group.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_monitor_smart_detector_alert_rule.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_service_plan.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;00-af-td-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-apflpa-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-apl-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-apluta-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-bails-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-joh-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-sbails-sbox-uks-dlrm-01&#34;]
  * azurerm_storage_account.example[&#34;02-af-td-sbox-uks-dlrm-01&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.example["00-af-apflpa-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "94d159a4-926c-4d0e-ac3a-f9b8cbd3b3c5" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-apflpa-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "00-af-apflpa-sbox-uks-dlrm-01" -> "af-apflpa-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-apl-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "23f570cd-2de3-43a3-8265-73198ad8d140" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-apl-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "00-af-apl-sbox-uks-dlrm-01" -> "af-apl-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-apluta-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "0b76f646-333d-44cb-9d00-28ebb4a48855" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-apluta-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "00-af-apluta-sbox-uks-dlrm-01" -> "af-apluta-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-bails-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "7d9e8a2b-9d71-4cb6-a8fa-bfeb3ac848e3" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-bails-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "00-af-bails-sbox-uks-dlrm-01" -> "af-bails-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-joh-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "7bedf465-1015-46b8-a6fb-7ebc071a0d4f" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-joh-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "00-af-joh-sbox-uks-dlrm-01" -> "af-joh-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-sbails-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "ac7baa1a-afb4-4790-8a07-cf9d54daae21" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-sbails-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "00-af-sbails-sbox-uks-dlrm-01" -> "af-sbails-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["00-af-td-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "89b0025e-9660-4b1c-890b-ec30f36e3fef" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Insights/components/00-af-td-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "00-af-td-sbox-uks-dlrm-01" -> "af-td-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-apflpa-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "db9e45f5-35d4-4829-ba75-646c42c851b1" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-apflpa-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "02-af-apflpa-sbox-uks-dlrm-01" -> "af-apflpa-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-apl-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "602e5221-41d1-4b98-b801-ff6a5075dc9c" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-apl-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "02-af-apl-sbox-uks-dlrm-01" -> "af-apl-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-apluta-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "100e1cd8-7753-4567-8f45-615f0ea6cea7" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-apluta-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "02-af-apluta-sbox-uks-dlrm-01" -> "af-apluta-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-bails-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "9efcba1d-76e1-4024-905c-4a128d8fbcfe" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-bails-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "02-af-bails-sbox-uks-dlrm-01" -> "af-bails-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-joh-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "c18827fa-5a51-4a46-8b77-8608731140da" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-joh-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "02-af-joh-sbox-uks-dlrm-01" -> "af-joh-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-sbails-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "83f2dc02-9613-4862-8723-24a5133a9648" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-sbails-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "02-af-sbails-sbox-uks-dlrm-01" -> "af-sbails-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_application_insights.example["02-af-td-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_application_insights" "example" {
      ~ app_id                                = "8638aea9-8e35-4cfc-b579-4b1bc6652483" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      - daily_data_cap_notifications_disabled = false -> null
      ~ id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Insights/components/02-af-td-sbox-uks-dlrm-01" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "02-af-td-sbox-uks-dlrm-01" -> "af-td-sbox-uks-dlrm-01" # forces replacement
        tags                                  = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (12 unchanged attributes hidden)
    }

  # azurerm_linux_function_app.example["02-af-apflpa-sbox-uks-dlrm-01"] will be created
  + resource "azurerm_linux_function_app" "example" {
      + app_settings                                   = (known after apply)
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "uksouth"
      + name                                           = "af-apflpa-sbox-uks-dlrm-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "ingest02-main-sbox"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ingest02xcuttingsbox"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + virtual_network_backup_restore_enabled         = false
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = false
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_defaul

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

     ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (22 unchanged attributes hidden)

      ~ blob_properties (known after apply)
      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ network_rules (known after apply)

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

  # azurerm_storage_account.example["02-af-sbails-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_storage_account" "example" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/02afsbailssboxuksdlrm01" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
      ~ name                               = "02afsbailssboxuksdlrm01" -> "afsbailssboxuksdlrm01" # forces replacement
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://02afsbailssboxuksdlrm01.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "02afsbailssboxuksdlrm01.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://02afsbailssboxuksdlrm01.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "02afsbailssboxuksdlrm01.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://02afsbailssboxuksdlrm01.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "02afsbailssboxuksdlrm01.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://02afsbailssboxuksdlrm01.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "02afsbailssboxuksdlrm01.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://02afsbailssboxuksdlrm01.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "02afsbailssboxuksdlrm01.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://02afsbailssboxuksdlrm01.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "02afsbailssboxuksdlrm01.z33.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (22 unchanged attributes hidden)

      ~ blob_properties (known after apply)
      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ network_rules (known after apply)

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

  # azurerm_storage_account.example["02-af-td-sbox-uks-dlrm-01"] must be replaced
-/+ resource "azurerm_storage_account" "example" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/02aftdsboxuksdlrm01" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
      ~ name                               = "02aftdsboxuksdlrm01" -> "aftdsboxuksdlrm01" # forces replacement
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://02aftdsboxuksdlrm01.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "02aftdsboxuksdlrm01.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://02aftdsboxuksdlrm01.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "02aftdsboxuksdlrm01.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://02aftdsboxuksdlrm01.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "02aftdsboxuksdlrm01.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://02aftdsboxuksdlrm01.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "02aftdsboxuksdlrm01.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://02aftdsboxuksdlrm01.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "02aftdsboxuksdlrm01.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://02aftdsboxuksdlrm01.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "02aftdsboxuksdlrm01.z33.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (22 unchanged attributes hidden)

      ~ blob_properties (known after apply)
      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      ~ network_rules (known after apply)

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

Plan: 77 to add, 0 to change, 70 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":21,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->